app/views/meetings/_form.html.erb

SELECT "rooms".* FROM "rooms" WHERE "rooms"."status" = $1  [["status", "In Use"]]
---
      <%= form.label :room_id %>
      <%= collection_select(:meeting, :room_id, Room.where(status:"In Use").to_ary, :id, :name, {}, { class: "form-control" }) %>