app/views/users/show.html.erb

<div class="col-md-8">
    <% if @user.meetings.any? %>
---
SELECT  1 AS one FROM "meetings" WHERE "meetings"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]