app/controllers/meetings_controller.rb

  def index
    @meetings = Meeting.all
---
SELECT "meetings".* FROM "meetings"