app/controllers/meetings_controller.rb

  def index
  @meetings = Meeting.where(user_id:params[:user_id]).to_ary
---
SELECT "meetings".* FROM "meetings" WHERE "meetings"."user_id" = $1  [["user_id", 2]]