app/controllers/rooms_controller.rb

  def show
    @room = Room.find(params[:id])
---
SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @room = Room.new(room_params)
    if @room.save
---
INSERT INTO "rooms" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Con1"], ["created_at", "2019-01-20 18:59:43.192239"], ["updated_at", "2019-01-20 18:59:43.192239"]]

  def destroy
    Room.find(params[:id]).destroy
---
DELETE FROM "rooms" WHERE "rooms"."id" = $1  [["id", 1]]
SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]