app/controllers/users_controller.rb

  def index
  @users = User.where(activated: true)
---
SELECT "users".* FROM "users" WHERE "users"."activated" = $1  [["activated", true]]

  def create
    @user = User.new(user_params)
      if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest", "activation_digest") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"